//
//  DataStructure.swift
//  health-plus
//
//  Created by Yo Higashida on 2021/02/28.
//

import Foundation

struct HealthData: Codable {
    var eat: Array<EatData>?
    var run: Array<RunData>?
}

struct EatData: Codable {
    let type: String
    let genre: String
    let content: String
    let more: String
    let cal: Int
}

struct RunData: Codable {
    let genre: String
    let content: String
    let more: String
    let time: Int
    let cal: Int
}

let genreData = ["基本メニュー", "和食", "洋食", "中華", "デザート/飲み物"]
let contentData = [
    "0": ["ご飯1膳軽盛り（100g）", "ご飯1膳普通盛り（140g）", "ご飯1膳大盛り（240g）", "食パン1枚（6枚切り）", "食パン1枚（8枚切り）"],
    "1": ["カツ丼", "親子丼", "天丼", "牛丼", "卵丼", "鉄火丼", "ねぎとろ丼", "中華丼", "鰻重", "五目チラシ", "刺身定食", "あじの塩焼き定食", "ブリの照り焼き定食", "サバのみそ煮定食", "生姜焼き定食", "鶏の照焼定食", "ぞうすい", "梅茶づけ", "天ぷらそば", "ざるそば", "かけそば", "かけそば", "たぬきそば", "きつねうどん", "月見うどん", "焼きそば", "お好み焼き", "広島焼き", "たこやき", "ヒレかつ", "串かつ", "ロースかつ", "カキフライ"],
    "2": ["スパゲッティ ミートソース", "スパゲッティ カルボナーラ", "スパゲッティ ペペロンチーノ", "スパゲッティ 和風ツナおろし", "スパゲッティ タラコ", "スパゲッティ ボンゴレ", "ピザ（小１枚）", "エビグラタン", "チキングラタン", "ポテトグラタン", "ハンバーガー", "チーズバーガー", "フライドポテト（S）", "ビーフカレー", "チキンカレー", "野菜カレー", "かつカレー", "ドライカレー", "ハヤシライス", "エビピラフ", "チキンピラフ", "オムライス", "ドリア", "キノコリゾット", "ハンバーグ", "和風ハンバーグ", "ハンバーグ（デミ）", "照焼ハンバーグ", "サーロインステーキ", "ヒレステーキ", "ロールキャベツ", "チキンソテー"],
    "3": ["ラーメン", "塩ラーメン", "みそラーメン", "五目ラーメン", "チャーシューメン", "冷やし中華", "冷めん", "あんかけかた焼きそば", "あんかけ焼きそば", "焼きビーフン", "麻婆豆腐定食", "青椒肉絲定食", "八宝菜定食", "回鍋肉定食", "エビチリ定食", "麻婆茄子定食", "チャーハン", "五目チャーハン", "ビビンバ", "クッパ", "カニ玉", "酢豚", "みそ炒め", "レバニラ炒め（豚レバー）", "ギョーザ", "シュウマイ", "小龍包", "春巻き", "ちまき", "にら饅頭", "バンバンジー", "肉マン"],
    "4": ["", ""]
]
